surfacesAreCoincident(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,Trf!System.Runtime.CompilerServices.IsConst*,System.Boolean*,TrfUV*,System.Boolean*,TessEpsCntrl!System.Runtime.CompilerServices.IsConst*,System.Boolean*,PlaneDataCache*,PlaneDataCache*)
Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer,
the surfaces must have the same type (e.g., two planes).
pTessEpsCntrl is an optional input argument. If it is not null, pTessEpsCntrl->getVertexEps()
will be used as a 3D tolerance in determining coincidence, otherwise DOUBLE_EPS will be used.
If the surfaces are known to be at a certain transform with respect to each other,
they can still be tested without having to copy and transform one of them -
by supplying non-NULL pS1ToS2Trf.
If the optional output argument pFoundTransform is not null, this routine will
attempt to determine if the surfaces differ only by a rigid motion from the parameter
space of pSurface2 into that of pSurface1. The 2D transformation, if found, will
be stored in the optional output argument pTrfUV2ToUV1 (if this argument is not null).
A transformation will be found for coaxial cylinders and parallel planes even if the
surfaces are not coincident.
Usage: pSurface1(pTrfUV2ToUV1(uv)) = pSurface2(uv).
The type of rigid motion permitted depends on the surface type. For planes, any rigid
motion is allowed. For cylinders, the motion must be a combination of reflection in
the u axis, reflection in the v axis, and translation (in the uv plane).
Optional output pOrientationsAgree is set only if the surfaces are geometrically
coincident (i.e., if the function returns "true"). It will be set to true if the surface
orientations agree, false if not. Note that the surface orientations take the surface's
orientation flag into account.
If this function returns true, optional output pExactCoinc will be set to true if:
1) the surfaces are exactly coincident, and
2) either the transform was not requested, or the transform was requested and it's exact.
Do not use this output if the function returns false.